cmsis-svd/cmsis-svd/data/Spansion/MB9AF42xL_svd.xml
        <!-- REGISTER "ADCMP_ACCP0" -->
        <register>
          <name>ADCMP_ACCP0</name>
          <description> register ADCMP_ACCP0 </description>
          <addressOffset>0xA0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "ADCMP_ACCP1" -->
        <register derivedFrom="ADCMP_ACCP0">
          <name>ADCMP_ACCP1</name>
          <description> register ADCMP_ACCP1 </description>
          <addressOffset>0xA8</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACCP2" -->
        <register derivedFrom="ADCMP_ACCP0">
          <name>ADCMP_ACCP2</name>
          <description> register ADCMP_ACCP2 </description>
          <addressOffset>0xB0</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACCPDN0" -->
        <register>
          <name>ADCMP_ACCPDN0</name>
          <description> register ADCMP_ACCPDN0 </description>
          <addressOffset>0xA4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "ADCMP_ACCPDN1" -->
        <register derivedFrom="ADCMP_ACCPDN0">
          <name>ADCMP_ACCPDN1</name>
          <description> register ADCMP_ACCPDN1 </description>
          <addressOffset>0xAC</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACCPDN2" -->
        <register derivedFrom="ADCMP_ACCPDN0">
          <name>ADCMP_ACCPDN2</name>
          <description> register ADCMP_ACCPDN2 </description>
          <addressOffset>0xB4</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ATSA" -->
        <register>
          <name>ADCMP_ATSA</name>
          <description> register ADCMP_ATSA </description>
          <addressOffset>0xC0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0303</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AD0S" -->
            <field>
              <name>AD0S</name>
              <description> bitfield AD0S </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AD0P" -->
            <field>
              <name>AD0P</name>
              <description> bitfield AD0P </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "BTIOSEL03" -->
    <peripheral>
      <name>BTIOSEL03</name>
      <description> peripheral BTIOSEL03 </description>
      <groupName>BTIOSEL03</groupName>
      <baseAddress>0x40025100</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSEL0123" -->
        <register>
          <name>BTSEL0123</name>
          <description> register BTSEL0123 </description>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEL23_" -->
            <field>
              <name>SEL23_</name>
              <description> bitfield SEL23_ </description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL01_" -->
            <field>
              <name>SEL01_</name>
              <description> bitfield SEL01_ </description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "BTIOSEL47" -->
    <peripheral>
      <name>BTIOSEL47</name>
      <description> peripheral BTIOSEL47 </description>
      <groupName>BTIOSEL47</groupName>
      <baseAddress>0x40025300</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSEL4567" -->
        <register>
          <name>BTSEL4567</name>
          <description> register BTSEL4567 </description>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEL67_" -->
            <field>
              <name>SEL67_</name>
              <description> bitfield SEL67_ </description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL45_" -->
            <field>
              <name>SEL45_</name>
              <description> bitfield SEL45_ </description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "SBSSR" -->
    <peripheral>
      <name>SBSSR</name>
      <description> peripheral SBSSR </description>
      <groupName>SBSSR</groupName>
      <baseAddress>0x40025F00</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0FC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSSSR" -->
        <register>
          <name>BTSSSR</name>
          <description> register BTSSSR </description>
          <addressOffset>0xFC</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SSSR15" -->
            <field>
              <name>SSSR15</name>
              <description> bitfield SSSR15 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR14" -->
            <field>
              <name>SSSR14</name>
              <description> bitfield SSSR14 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR13" -->
            <field>
              <name>SSSR13</name>
              <description> bitfield SSSR13 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR12" -->
            <field>
              <name>SSSR12</name>
              <description> bitfield SSSR12 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR11" -->
            <field>
              <name>SSSR11</name>
              <description> bitfield SSSR11 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR10" -->
            <field>
              <name>SSSR10</name>
              <description> bitfield SSSR10 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR9" -->
            <field>
              <name>SSSR9</name>
              <description> bitfield SSSR9 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR8" -->
            <field>
              <name>SSSR8</name>
              <description> bitfield SSSR8 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR7" -->
            <field>
              <name>SSSR7</name>
              <description> bitfield SSSR7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR6" -->
            <field>
              <name>SSSR6</name>
              <description> bitfield SSSR6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR5" -->
            <field>
              <name>SSSR5</name>
              <description> bitfield SSSR5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR4" -->
            <field>
              <name>SSSR4</name>
              <description> bitfield SSSR4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR3" -->
            <field>
              <name>SSSR3</name>
              <description> bitfield SSSR3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR2" -->
            <field>
              <name>SSSR2</name>
              <description> bitfield SSSR2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR1" -->
            <field>
              <name>SSSR1</name>
              <description> bitfield SSSR1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR0" -->
            <field>
              <name>SSSR0</name>
              <description> bitfield SSSR0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
