cmsis-svd/cmsis-svd/data/Spansion/MB9AF42xL_svd.xml
        <!-- REGISTER "PPG_PRLL" -->
        <register>
          <name>PPG_PRLL</name>
          <description> register PPG_PRLL </description>
          <alternateGroup>PPG</alternateGroup>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
        </register>
        <!-- REGISTER "PPG_PRLH" -->
        <register>
          <name>PPG_PRLH</name>
          <description> register PPG_PRLH </description>
          <alternateGroup>PPG</alternateGroup>
          <addressOffset>0x04</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
        </register>
        <!-- REGISTER "PPG_TMR" -->
        <register>
          <name>PPG_TMR</name>
          <description> register PPG_TMR </description>
          <alternateGroup>PPG</alternateGroup>
          <addressOffset>0x08</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "RT_TMCR" -->
        <register>
          <name>RT_TMCR</name>
          <description> register RT_TMCR </description>
          <alternateGroup>RT</alternateGroup>
          <addressOffset>0x0C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x73FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CKS2_0" -->
            <field>
              <name>CKS2_0</name>
              <description> bitfield CKS2_0 </description>
              <lsb>12</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EGS" -->
            <field>
              <name>EGS</name>
              <description> bitfield EGS </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "T32" -->
            <field>
              <name>T32</name>
              <description> bitfield T32 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FMD" -->
            <field>
              <name>FMD</name>
              <description> bitfield FMD </description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OSEL" -->
            <field>
              <name>OSEL</name>
              <description> bitfield OSEL </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MDSE" -->
            <field>
              <name>MDSE</name>
              <description> bitfield MDSE </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CTEN" -->
            <field>
              <name>CTEN</name>
              <description> bitfield CTEN </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG" -->
            <field>
              <name>STRG</name>
              <description> bitfield STRG </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RT_TMCR2" -->
        <register>
          <name>RT_TMCR2</name>
          <description> register RT_TMCR2 </description>
          <alternateGroup>RT</alternateGroup>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CKS3" -->
            <field>
              <name>CKS3</name>
              <description> bitfield CKS3 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RT_STC" -->
        <register>
          <name>RT_STC</name>
          <description> register RT_STC </description>
          <alternateGroup>RT</alternateGroup>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x55</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TGIE" -->
            <field>
              <name>TGIE</name>
              <description> bitfield TGIE </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UDIE" -->
            <field>
              <name>UDIE</name>
              <description> bitfield UDIE </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TGIR" -->
            <field>
              <name>TGIR</name>
              <description> bitfield TGIR </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UDIR" -->
            <field>
              <name>UDIR</name>
              <description> bitfield UDIR </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RT_PCSR" -->
        <register>
          <name>RT_PCSR</name>
          <description> register RT_PCSR </description>
          <alternateGroup>RT</alternateGroup>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
        </register>
